luomeng16888/stm32-ota-update/bootloader/STM32F407/Projects/MDK-ARM/bootloader_main.c
/**
 * ================================================================
 *  Bootloader v3.2 — ????????? + CCM RAM??
 * ================================================================
 *  ???? (v3.1 ? v3.2):
 *
 *  [v3.2] ?? is_valid_version() ?????????
 *  [v3.2] ?? boot.cfg ??????????
 *  [v3.2] RTC ????????????????
 *  [v3.2] boot_cfg_default ??? SYS_VERSION ?? SD (?????)
 *  [FIX]  jump_to_app ???????? BKP4R (APP ???? VTOR)
 *  [FIX]  is_app_valid ?? CCM RAM (0x1000xxxx) ???
 *  [FIX]  ??????:????????????,????A??
 *
 *  startup_stm32f407xx.s ? Stack_Size ?? 0x2000 (8KB)
 *
 *  Flash ??:
 *    0x08000000 +------------------+ Sector 0~5  (256KB) Bootloader
 *    0x08040000 +------------------+ Sector 6~8  (384KB) APP_A
 *    0x080A0000 +------------------+ Sector 9~11 (384KB) APP_B
 *    0x08100000 +------------------+ Flash ?? 1MB
 * ================================================================
 */

#include <stdarg.h>
#include "./SYSTEM/sys/sys.h"
#include "./SYSTEM/usart/usart.h"
#include "./SYSTEM/delay/delay.h" 
#include "./BSP/LED/led.h"
#include "./BSP/LCD/lcd.h"
#include "./BSP/SDIO/sdio_sdcard.h"
#include "./FATFS/source/ff.h"
#include "./MALLOC/malloc.h"
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include "stm32f4xx.h"
#include "boot_cfg.h"

/* ==============================================================
 *  Flash ????
 * ============================================================== */
#define FLASH_BOOT_ADDR         0x08000000
#define FLASH_BOOT_SIZE         (256 * 1024)

#define FLASH_APP_A_ADDR        0x08040000
#define FLASH_APP_B_ADDR        0x080A0000
#define FLASH_APP_SIZE          (384 * 1024)

/* SD ????? (????, ?? boot.cfg ????) */
#define SD_FW_FLAG          "0:/OTA/update.flag"
#define SD_FW_BIN           "0:/OTA/fw_new.bin"
#define SD_FW_PATCH         "0:/OTA/patch.bin"
#define SD_FW_OLD           "0:/OTA/fw_old.bin"

#define SYS_VERSION         "1.0.0"
#define BKUP_MAGIC          0x4F544142

/* BKP ????? */
#define BKUP_REG_MAGIC      RTC->BKP0R
#define BKUP_REG_PART       RTC->BKP1R
#define BKUP_REG_VERSION    RTC->BKP2R
#define BKUP_REG_HEALTH     RTC->BKP3R
#define BKUP_REG_JUMP_ADDR  RTC->BKP4R    /* [FIX] ?????? */

/* RGB565 ?? */
#define C_WHITE     0xFFFF
#define C_BLACK     0x0000
#define C_RED       0xF800
#define C_GREEN     0x07E0
#define C_CYAN      0x07FF
#define C_ORANGE    0xFD20
#define C_GRAY      0x8430
#define C_DARKBLUE  0x01CF

static FATFS fs;
static uint8_t rw_buf[4096];

/* ==============================================================
 *  LCD ??
 * ============================================================== */
static void lcd_c(uint16_t x, uint16_t y, uint16_t w, uint16_t h,
                  uint8_t sz, const char *s, uint16_t color)
{
    lcd_show_string(x, y, w, h, sz, (char *)s, color);
}
static void lcd_title(uint16_t y, const char *s)
{ lcd_c(10, y, 300, 24, 24, s, C_DARKBLUE); }
static void lcd_info(uint16_t y, const char *s)
{ lcd_c(10, y, 300, 16, 16, s, C_BLACK); }
static void lcd_ok(uint16_t y, const char *s)
{ lcd_c(10, y, 300, 16, 16, s, C_GREEN); }
static void lcd_err(uint16_t y, const char *s)
{ lcd_c(10, y, 300, 16, 16, s, C_RED); }
static void lcd_warn(uint16_t y, const char *s)
{ lcd_c(10, y, 300, 16, 16, s, C_ORANGE); }
static void lcd_hint(uint16_t y, const char *s)
{ lcd_c(10, y, 300, 16, 16, s, C_GRAY); }
static void lcd_fmt(uint16_t y, uint16_t color, const char *fmt, ...)
{
    char buf[64];
    va_list ap;
    va_start(ap, fmt);
    vsnprintf(buf, sizeof(buf), fmt, ap);
    va_end(ap);
    lcd_c(10, y, 300, 16, 16, buf, color);
}

/* ==============================================================
 *  SD ?
 * ============================================================== */
static bool sd_safe_init(void)
{
    delay_ms(300);
    for (uint8_t retry = 0; retry < 3; retry++) {
        printf("[SD] Attempt %d...\r\n", retry + 1);
        if (sd_init() == 0) {
            printf("[SD] Init OK\r\n");
            return true;
        }
        delay_ms(300);
    }
    printf("[SD] All attempts failed\r\n");
    return false;
}

static bool sd_reinit(void)
{
    f_mount(NULL, "0:", 0);
    delay_ms(50);
    memset(&fs, 0, sizeof(fs));
    if (f_mount(&fs, "0:", 0) != FR_OK) {
        printf("[SD] re-mount fail\r\n");
        return false;
    }
    delay_ms(50);
    return true;
}

/* ==============================================================
 *  Backup Registers
 * ============================================================== */
static void bkup_enable(void)
{
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    PWR->CR |= PWR_CR_DBP;
}

static uint32_t pack_ver(const char *ver)
{
    int maj = 0, min = 0, pat = 0;
    sscanf(ver, "%d.%d.%d", &maj, &min, &pat);
    return (uint32_t)((maj << 24) | (min << 16) | (pat & 0xFFFF));
}

static void unpack_ver(uint32_t v, char *buf, int len)
{
    snprintf(buf, len, "%d.%d.%d",
             (int)((v >> 24) & 0xFF), (int)((v >> 16) & 0xFF),
             (int)(v & 0xFFFF));
}

static void bkup_save_update(char part, const char *ver)
{
    BKUP_REG_MAGIC   = BKUP_MAGIC;
    BKUP_REG_PART    = (uint32_t)part;
    BKUP_REG_VERSION = pack_ver(ver);
    printf("[BKUP] Save: part=%c ver=%s\r\n", part, ver);
}

static bool bkup_load_update(char *part, char *ver, int verlen)
{
    if (BKUP_REG_MAGIC != BKUP_MAGIC || BKUP_REG_VERSION == 0)
        return false;
    char p = (char)BKUP_REG_PART;
    if (p != 'A' && p != 'B') return false;
    *part = p;
    unpack_ver(BKUP_REG_VERSION, ver, verlen);
    return true;
}

static void bkup_clear_update(void)
{
    BKUP_REG_MAGIC   = 0;
    BKUP_REG_PART    = 0;
    BKUP_REG_VERSION = 0;
    printf("[BKUP] Cleared\r\n");
}

/* ==============================================================
 *  Bootloader ????
 * ============================================================== */
static uint32_t get_app_addr(char part)
{
    return (part == 'B') ? FLASH_APP_B_ADDR : FLASH_APP_A_ADDR;
}

/* ==============================================================
 *  [v3.2] ?????
 *
 *  ??: "X.Y.Z",?? 1~3 ???, ?? < 16
 *  ??: "1.0.0", "2.3.15", "9.99.999"
 *  ??:  "90.90.23130" (??3???), "abc", "", "1.2"
 * ============================================================== */
static bool is_valid_version(const char *ver)
{
    int dots, digits;

    if (!ver || !ver[0]) return false;
    if (strlen(ver) == 0 || strlen(ver) >= 16) return false;

    dots = 0;
    digits = 0;
    for (const char *p = ver; *p; p++) {
        if (*p == '.') {
            dots++;
            if (digits == 0 || digits > 3) return false;
            digits = 0;
        } else if (*p >= '0' && *p <= '9') {
            digits++;
            if (digits > 3) return false;
        } else {
            return false;
        }
    }
    if (digits == 0 || digits > 3) return false;
    return (dots == 2);
}

/* ==============================================================
 *  Flash ?? — WORD ??
 * ============================================================== */

static bool erase_partition(char part)
{
    uint8_t start = (part == 'A') ? 6 : 9;
    printf("[FLASH] Erase %c (Sector %d~%d)\r\n", part, start, start + 2);
    lcd_info(80, "Erasing Flash...");

