luomeng16888/stm32-ota-update/bootloader/STM32F407/Projects/MDK-ARM/bootloader_main.c
    HAL_FLASH_Unlock();
    for (uint8_t i = 0; i < 3; i++) {
        FLASH_EraseInitTypeDef erase;
        uint32_t err = 0;
        erase.TypeErase    = FLASH_TYPEERASE_SECTORS;
        erase.Sector       = start + i;
        erase.NbSectors    = 1;
        erase.VoltageRange = FLASH_VOLTAGE_RANGE_3;
        if (HAL_FLASHEx_Erase(&erase, &err) != HAL_OK) {
            printf("[FLASH] Erase fail sector %d\r\n", start + i);
            HAL_FLASH_Lock();
            return false;
        }
    }
    HAL_FLASH_Lock();
    printf("[FLASH] Erase OK\r\n");
    return true;
}

static bool flash_file_to_partition(const char *path, char part)
{
    FIL fil; UINT br;
    uint32_t addr = get_app_addr(part);
    uint32_t written = 0, fsize, last_pct = 0xFF;

    printf("[FLASH] Flash %c from %s\r\n", part, path);

    if (!erase_partition(part))
        return false;

    lcd_info(80, "Writing firmware...");
    sd_reinit();
    if (f_open(&fil, path, FA_READ) != FR_OK) {
        printf("[FLASH] Open %s fail\r\n", path);
        return false;
    }
    fsize = (uint32_t)f_size(&fil);
    printf("[FLASH] Size: %luB\r\n", (unsigned long)fsize);
    lcd_fmt(100, C_GRAY, "Size: %lu bytes", (unsigned long)fsize);

    /* === ?? === */
    HAL_FLASH_Unlock();
    while (1) {
        if (f_read(&fil, rw_buf, sizeof(rw_buf), &br) != FR_OK || br == 0)
            break;

        uint32_t aligned = br & ~3U;
        for (uint32_t i = 0; i < aligned; i += 4) {
            uint32_t word = *(uint32_t *)(rw_buf + i);
            if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, word) != HAL_OK) {
                printf("[FLASH] Write fail @ 0x%08lX\r\n", (unsigned long)addr);
                HAL_FLASH_Lock();
                f_close(&fil);
                return false;
            }
            addr += 4;
        }
        if (br > aligned) {
            uint8_t tail[4] = {0xFF, 0xFF, 0xFF, 0xFF};
            memcpy(tail, rw_buf + aligned, br - aligned);
            HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, *(uint32_t *)tail);
            addr += 4;
        }

        written += br;
        {
            uint32_t pct = fsize ? (written * 100 / fsize) : 0;
            if (pct != last_pct) {
                lcd_fmt(125, C_CYAN, "Writing... %lu%%", (unsigned long)pct);
                last_pct = pct;
            }
        }
    }
    HAL_FLASH_Lock();
    f_close(&fil);
    printf("[FLASH] Written %luB\r\n", (unsigned long)written);

    /* === ?? === */
    lcd_info(150, "Verifying...");
    sd_reinit();
    if (f_open(&fil, path, FA_READ) != FR_OK) {
        printf("[FLASH] Verify: reopen fail\r\n");
        return false;
    }
    {
        uint32_t vaddr = get_app_addr(part);
        uint32_t voff = 0;
        bool verify_ok = true;
        while (1) {
            if (f_read(&fil, rw_buf, sizeof(rw_buf), &br) != FR_OK || br == 0)
                break;
            if (memcmp(rw_buf, (void *)vaddr, br) != 0) {
                printf("[FLASH] Verify mismatch @ offset 0x%08lX\r\n",
                       (unsigned long)voff);
                verify_ok = false;
                break;
            }
            vaddr += br;
            voff += br;
        }
        f_close(&fil);
        if (!verify_ok) return false;
    }
    printf("[FLASH] Verify OK\r\n");
    return true;
}

/* ==============================================================
 *  SDIFF01 ???? Flash
 * ============================================================== */

static bool flash_copy_partition(char src_part, char dst_part)
{
    uint32_t src_addr = get_app_addr(src_part);
    uint32_t dst_addr = get_app_addr(dst_part);
    uint32_t chunk_buf[256];

    printf("[FLASH] Copy %c(0x%08lX) -> %c(0x%08lX)\r\n",
           src_part, (unsigned long)src_addr,
           dst_part, (unsigned long)dst_addr);

    for (uint32_t off = 0; off < FLASH_APP_SIZE; off += sizeof(chunk_buf)) {
        for (int i = 0; i < 256; i++) {
            chunk_buf[i] = *(volatile uint32_t *)(src_addr + off + i * 4);
        }
        for (int i = 0; i < 256; i++) {
            if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD,
                                  dst_addr + off + i * 4,
                                  chunk_buf[i]) != HAL_OK) {
                printf("[FLASH] Copy fail @ 0x%08lX\r\n",
                       (unsigned long)(dst_addr + off + i * 4));
                return false;
            }
        }
    }
    printf("[FLASH] Copy done (%luB)\r\n", (unsigned long)FLASH_APP_SIZE);
    return true;
}

static bool apply_sdiff_to_flash(const char *patch_path,
                                  char src_part, char dst_part)
{
    FIL pf;
    UINT br;
    uint8_t hdr[16];
    uint32_t new_sz, count, i;
    uint8_t *dbuf;
    uint32_t patched = 0;
    uint32_t dst_addr = get_app_addr(dst_part);
    uint32_t t0 = HAL_GetTick();

    printf("[SDIFF] Apply %s: %c -> %c\r\n", patch_path, src_part, dst_part);

    if (f_open(&pf, patch_path, FA_READ) != FR_OK) {
        printf("[SDIFF] open patch fail\r\n");
        return false;
    }
    if (f_read(&pf, hdr, 16, &br) != FR_OK || br != 16) {
        printf("[SDIFF] read hdr fail\r\n");
        f_close(&pf);
        return false;
    }
    if (memcmp(hdr, "SDIFF01", 7) != 0) {
        printf("[SDIFF] bad magic\r\n");
        f_close(&pf);
        return false;
    }
    new_sz = *(uint32_t *)(hdr + 8);
    count  = *(uint32_t *)(hdr + 12);
    printf("[SDIFF] new_sz=%lu count=%lu\r\n",
           (unsigned long)new_sz, (unsigned long)count);

    lcd_info(80, "Erasing target...");
    if (!erase_partition(dst_part)) {
        f_close(&pf);
        return false;
    }

    lcd_info(80, "Copying partition...");
    HAL_FLASH_Unlock();
    if (!flash_copy_partition(src_part, dst_part)) {
        HAL_FLASH_Lock();
        f_close(&pf);
        return false;
    }

    lcd_info(80, "Applying patch...");
    dbuf = mymalloc(SRAMIN, 4096);
    if (!dbuf) {
        printf("[SDIFF] malloc fail\r\n");
        HAL_FLASH_Lock();
        f_close(&pf);
        return false;
    }

    for (i = 0; i < count; i++) {
        uint32_t offset, len;
        f_read(&pf, &offset, 4, &br);
        f_read(&pf, &len,    4, &br);

