luomeng16888/stm32-ota-update/bootloader/STM32F407/Projects/MDK-ARM/bootloader_main.c
        if (len > 4096 || offset + len > FLASH_APP_SIZE) {
            printf("[SDIFF] chunk %lu invalid\r\n", (unsigned long)i);
            myfree(SRAMIN, dbuf);
            HAL_FLASH_Lock();
            f_close(&pf);
            return false;
        }

        f_read(&pf, dbuf, len, &br);

        uint32_t target = dst_addr + offset;
        uint32_t aligned = len & ~3U;
        for (uint32_t j = 0; j < aligned; j += 4) {
            HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD,
                              target + j, *(uint32_t *)(dbuf + j));
        }
        if (len > aligned) {
            uint8_t tail[4] = {0xFF, 0xFF, 0xFF, 0xFF};
            memcpy(tail, dbuf + aligned, len - aligned);
            HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD,
                              target + aligned, *(uint32_t *)tail);
        }

        patched += len;

        if (count > 0 && (i % (count / 10 + 1) == 0 || i == count - 1)) {
            uint32_t pct = (i + 1) * 100 / count;
            lcd_fmt(100, C_CYAN, "Patching... %lu%%", (unsigned long)pct);
        }
    }

    HAL_FLASH_Lock();
    myfree(SRAMIN, dbuf);
    f_close(&pf);

    printf("[SDIFF] OK: %luB patched, %lu blocks, %lu ms\r\n",
           (unsigned long)patched, (unsigned long)count,
           (unsigned long)(HAL_GetTick() - t0));
    return true;
}

/* ==============================================================
 *  ?? / ??????
 * ============================================================== */

static bool sd_full_update(const char *fw_path, char target_part,
                            const char *new_ver, BootCfg *cfg)
{
    if (!flash_file_to_partition(fw_path, target_part)) {
        lcd_err(80, "Flash write FAILED!");
        return false;
    }

    boot_cfg_update_ver(cfg, target_part, new_ver);
    boot_cfg_set_active(cfg, target_part);
    boot_cfg_write(cfg);

    lcd_ok(80, "Firmware written OK!");
    return true;
}

static bool sd_diff_update(const char *patch_path, char target_part,
                            char src_part, const char *new_ver,
                            BootCfg *cfg)
{
    if (!apply_sdiff_to_flash(patch_path, src_part, target_part)) {
        lcd_err(80, "DIFF UPDATE FAILED!");
        return false;
    }

    boot_cfg_update_ver(cfg, target_part, new_ver);
    boot_cfg_set_active(cfg, target_part);
    boot_cfg_write(cfg);

    lcd_ok(80, "DIFF UPDATE OK!");
    return true;
}

/* ==============================================================
 *  [FIX] ?? App ??? — ?? CCM RAM (0x1000xxxx)
 *
 *  STM32F407 ??? RAM ??:
 *    ? SRAM:  0x20000000 ~ 0x2001FFFF (128KB)
 *    CCM RAM:  0x10000000 ~ 0x1000FFFF (64KB, ?CPU???)
 *
 *  ??????????????? CCM RAM,
 *  ?? SP = 0x1000xxxx,??? (sp & 0x2FF00000)==0x20000000 ??????
 *  ???? 0x1000xxxx ????
 * ============================================================== */

static bool is_app_valid(uint32_t addr)
{
    uint32_t sp = *(volatile uint32_t *)addr;
    uint32_t pc = *(volatile uint32_t *)(addr + 4);

    /* SP?????SRAM(0x2000xxxx)?CCM RAM(0x1000xxxx) */
    bool sp_ok = ((sp & 0x2FF00000) == 0x20000000) ||
                 ((sp & 0xFFF00000) == 0x10000000);
    bool pc_ok = ((pc & 0xFF000000) == 0x08000000);

    return sp_ok && pc_ok;
}

/* ==============================================================
 *  ??? App
 * ============================================================== */

static void jump_to_app(uint32_t addr)
{
    uint32_t sp, pc;
    if (!is_app_valid(addr)) {
        printf("[BOOT] APP invalid @ 0x%08lX!\r\n", (unsigned long)addr);
        lcd_err(130, "APP INVALID! Halted.");
        while (1) { LED0_TOGGLE(); delay_ms(200); }
    }

    sp = *(volatile uint32_t *)addr;
    pc = *(volatile uint32_t *)(addr + 4);

    printf("[BOOT] Jump -> 0x%08lX  SP=0x%08lX  PC=0x%08lX\r\n",
           (unsigned long)addr, (unsigned long)sp, (unsigned long)pc);

    /* ============================================================
     *  [FIX] ???????? BKP4R
     *
     *  ??: Bootloader ??? SCB->VTOR = addr,
     *  ? APP ? SystemInit() ?? VTOR ??? 0x08040000,
     *  ???? B ?, VTOR ??? A, ??????, WiFi ????
     *
     *  APP ? main() ?? BKP4R ??? VTOR:
     *    SCB->VTOR = BKUP_REG_JUMP_ADDR;
     * ============================================================ */
    bkup_enable();
    BKUP_REG_JUMP_ADDR = addr;
    printf("[BKUP] Stored jump addr: 0x%08lX\r\n", (unsigned long)addr);

    /* ???????? */
    while (!(USART1->SR & USART_SR_TC));

    /* ?????? */
    f_mount(NULL, "0:", 0);

    /* ??? */
    __disable_irq();

    /* ?? SysTick */
    SysTick->CTRL = 0;
    SysTick->LOAD = 0;
    SysTick->VAL  = 0;

    /* ???? NVIC ?? */
    for (int i = 0; i < 8; i++) {
        NVIC->ICER[i] = 0xFFFFFFFF;
        NVIC->ICPR[i] = 0xFFFFFFFF;
    }

    /* ?? SDIO */
    SDIO->DCTRL = 0;
    SDIO->CLKCR = 0;
    SDIO->POWER = 0;
    SDIO->ICR   = 0x00C007FF;

    /* ?? DMA */
    DMA1_Stream0->CR &= ~DMA_SxCR_EN;
    DMA1_Stream5->CR &= ~DMA_SxCR_EN;
    DMA2_Stream0->CR &= ~DMA_SxCR_EN;
    DMA2_Stream3->CR &= ~DMA_SxCR_EN;
    DMA2_Stream6->CR &= ~DMA_SxCR_EN;
    DMA1->LIFCR = 0xFFFFFFFF;
    DMA1->HIFCR = 0xFFFFFFFF;
    DMA2->LIFCR = 0xFFFFFFFF;
    DMA2->HIFCR = 0xFFFFFFFF;

    /* ?? USART1 (????) */
    USART1->CR1 = 0;
    RCC->APB2ENR &= ~(1 << 11);

    /* ?? USART3 (WiFi ??) */
    USART3->CR1 = 0;
    RCC->APB1ENR &= ~(1 << 18);

    /* ?? VTOR */
    SCB->VTOR = addr;

    /* ?? */
    __set_MSP(sp);
    __DSB();
    __ISB();

    ((void (*)(void))pc)();

    /* ??????? */
    while (1) { LED0_TOGGLE(); delay_ms(100); }
}

/* ==============================================================
 *  ?? & ??
 * ============================================================== */

static uint8_t key0_pressed(void)
{
    if ((GPIOE->IDR & (1 << 4)) == 0) {
        delay_ms(10);
        if ((GPIOE->IDR & (1 << 4)) == 0) return 1;
    }
    return 0;
}

static void debug_dump_flash(uint32_t addr, int words)
{
    uint32_t *p = (uint32_t *)addr;
    printf("[DUMP] @ 0x%08lX:\r\n", (unsigned long)addr);
    for (int i = 0; i < words; i++) {
        printf("  [%02X] 0x%08lX\r\n", i * 4, (unsigned long)p[i]);
    }
    if (p[0] == 0xFFFFFFFF && p[1] == 0xFFFFFFFF) {
        printf("[DUMP] *** WARNING: Flash is blank! ***\r\n");
    }
}

/* ==============================================================
 *  MAIN
 * ============================================================== */
int main(void)
{
    BootCfg cfg;
    uint32_t target_addr;
    bool skip_sd = false;
    bool sd_ok = false;

    HAL_Init();
    sys_stm32_clock_init(336, 8, 2, 7);
    delay_init(168);
    usart_init(115200);
    led_init();
    lcd_init();
    my_mem_init(SRAMIN);
    bkup_enable();

