luomeng16888/stm32-ota-update/bootloader/STM32F407/Projects/MDK-ARM/bootloader_main.c
    g_back_color  = C_WHITE;
    g_point_color = C_BLACK;

    printf("\r\n========================================\r\n");
    printf("  Bootloader v3.2 (version validate)\r\n");
    printf("  APP_A @ 0x%08lX (%luKB)\r\n",
           (unsigned long)FLASH_APP_A_ADDR,
           (unsigned long)(FLASH_APP_SIZE / 1024));
    printf("  APP_B @ 0x%08lX (%luKB)\r\n",
           (unsigned long)FLASH_APP_B_ADDR,
           (unsigned long)(FLASH_APP_SIZE / 1024));
    printf("  Stack: 0x%08lX\r\n",
           (unsigned long)__get_MSP());
    printf("========================================\r\n");

    lcd_clear(C_WHITE);
    lcd_title(10, "Bootloader v3.2");

    boot_cfg_default(&cfg);

    /* ==========================================================
     *  ???? (KEY0 ??)
     * ========================================================== */
    {
        uint8_t held = 0;
        for (int i = 0; i < 10; i++) {
            delay_ms(50);
            if (key0_pressed()) held++;
        }
        if (held >= 5) {
            printf("[BOOT] Safe mode\r\n");
            skip_sd = true;
        }
    }

    if (skip_sd) {
        /* ??????????SD,???????boot.cfg */
        bool sd_safe = sd_safe_init();
        if (sd_safe) {
            if (f_mount(&fs, "0:", 1) != FR_OK) {
                sd_safe = false;
            }
        }

        /* ??boot.cfg????????? */
        if (sd_safe) {
            if (!boot_cfg_read(&cfg)) {
                printf("[BOOT] Safe mode: boot.cfg read fail, using defaults\r\n");
                boot_cfg_default(&cfg);
            }
        }
        boot_cfg_dump(&cfg);

        bool a_ok = is_app_valid(get_app_addr('A'));
        bool b_ok = is_app_valid(get_app_addr('B'));

        printf("[BOOT] Safe mode: A=%s B=%s (cur=%c)\r\n",
               a_ok ? "OK" : "INVALID",
               b_ok ? "OK" : "INVALID",
               cfg.active[0]);

        if (a_ok && b_ok) {
            /* ?????,???????? */
            if (cfg.active[0] == 'B') {
                boot_cfg_set_active(&cfg, 'A');
            } else {
                boot_cfg_set_active(&cfg, 'B');
            }
        } else if (a_ok) {
            boot_cfg_set_active(&cfg, 'A');
        } else if (b_ok) {
            boot_cfg_set_active(&cfg, 'B');
        } else {
            lcd_clear(C_WHITE);
            lcd_err(40, "NO VALID PARTITION!");
            lcd_err(65, "Both A & B corrupted!");
            lcd_hint(100, "Recovery options:");
            lcd_hint(120, "1. SD card full update");
            lcd_hint(140, "2. Re-flash via Keil");
            printf("[BOOT] FATAL: No valid partition!\r\n");
            while (1) {
                LED0_TOGGLE();
                delay_ms(300);
            }
        }

        /* ??:???????boot.cfg,??????????active */
        if (sd_safe) {
            boot_cfg_write(&cfg);
            printf("[BOOT] Safe mode: saved active=%c to boot.cfg\r\n",
                   cfg.active[0]);
        }

        lcd_clear(C_WHITE);
        lcd_warn(40, "Safe Mode - Rollback");
        lcd_fmt(65, C_CYAN, "Booting Partition %c",
                cfg.active[0]);
        lcd_fmt(85, C_GREEN, "v%s @ 0x%08lX",
                boot_cfg_active_ver(&cfg),
                (unsigned long)boot_cfg_active_addr(&cfg));
        printf("[BOOT] Safe mode -> Partition %c @ 0x%08lX (v%s)\r\n",
               cfg.active[0],
               (unsigned long)boot_cfg_active_addr(&cfg),
               boot_cfg_active_ver(&cfg));
        delay_ms(500);
        goto do_jump;
    }


    /* ==========================================================
     *  SD ????
     * ========================================================== */
    lcd_info(40, "Init SD card...");
    sd_ok = sd_safe_init();

    if (sd_ok) {
        if (f_mount(&fs, "0:", 1) != FR_OK) {
            printf("[BOOT] Mount fail\r\n");
            lcd_err(60, "Mount failed!");
            sd_ok = false;
        } else {
            lcd_ok(60, "SD card OK");
        }
    } else {
        lcd_err(40, "SD card failed!");
        lcd_hint(65, "Booting from Flash...");
    }

    /* ==========================================================
     *  ?? boot.cfg + [v3.2] ?????
     * ========================================================== */
    if (sd_ok) {
        if (!boot_cfg_read(&cfg)) {
            printf("[BOOT] boot.cfg not found, using defaults\r\n");
            boot_cfg_default(&cfg);
            boot_cfg_write(&cfg);
        }

        /* === [v3.2] ????? === */
        {
            bool need_fix = false;

            if (!is_valid_version(cfg.ver_a)) {
                printf("[BOOT] INVALID ver_a: [%s], reset to %s\r\n",
                       cfg.ver_a, SYS_VERSION);
                strncpy(cfg.ver_a, SYS_VERSION, sizeof(cfg.ver_a) - 1);
                cfg.ver_a[sizeof(cfg.ver_a) - 1] = '\0';
                need_fix = true;
            }
            if (!is_valid_version(cfg.ver_b)) {
                printf("[BOOT] INVALID ver_b: [%s], reset to %s\r\n",
                       cfg.ver_b, SYS_VERSION);
                strncpy(cfg.ver_b, SYS_VERSION, sizeof(cfg.ver_b) - 1);
                cfg.ver_b[sizeof(cfg.ver_b) - 1] = '\0';
                need_fix = true;
            }
            if (cfg.active[0] != 'A' && cfg.active[0] != 'B') {
                printf("[BOOT] INVALID active: [%c], reset to A\r\n",
                       cfg.active[0]);
                cfg.active[0] = 'A';
                cfg.active[1] = '\0';
                need_fix = true;
            }

            if (need_fix) {
                printf("[BOOT] Writing corrected boot.cfg...\r\n");
                boot_cfg_write(&cfg);
                printf("[BOOT] Fixed!\r\n");
            }
        }

        boot_cfg_dump(&cfg);

        /* RTC ?: ???????? */
        {
            char pend_part;
            char pend_ver[16];
            if (bkup_load_update(&pend_part, pend_ver, sizeof(pend_ver))) {
                uint32_t pend_addr = get_app_addr(pend_part);
                printf("[BKUP] Pending: part=%c ver=%s\r\n",
                       pend_part, pend_ver);

                /* [v3.2] ????? */
                if (!is_valid_version(pend_ver)) {
                    printf("[BKUP] Invalid pending ver: %s, skip\r\n", pend_ver);
                    bkup_clear_update();
                } else if (is_app_valid(pend_addr)) {
                    boot_cfg_update_ver(&cfg, pend_part, pend_ver);
                    boot_cfg_set_active(&cfg, pend_part);
                    boot_cfg_write(&cfg);
                    printf("[BKUP] Applied OK\r\n");
                    bkup_clear_update();
                } else {
                    printf("[BKUP] Partition %c invalid, skip\r\n",
                           pend_part);
                    bkup_clear_update();
                }
            }
        }

        /* ??????????, ???? */
        {
            uint32_t cur_addr = boot_cfg_active_addr(&cfg);
            if (!is_app_valid(cur_addr)) {
                char other = (cfg.active[0] == 'A') ? 'B' : 'A';
                uint32_t other_addr = get_app_addr(other);
                printf("[BOOT] Partition %c invalid!\r\n", cfg.active[0]);
                if (is_app_valid(other_addr)) {
                    boot_cfg_set_active(&cfg, other);
                    printf("[BOOT] Fallback to %c\r\n", other);
                } else {
                    boot_cfg_set_active(&cfg, 'A');
                    printf("[BOOT] No valid partition!\r\n");
                }
                boot_cfg_write(&cfg);
            }
        }

        lcd_fmt(85, C_CYAN, "Active: %c v%s",
                cfg.active[0], boot_cfg_active_ver(&cfg));

        /* ======================================================
         *  ?? SD ??? update.flag
         * ====================================================== */
        {
            FIL fil;
            UINT br;
            char flag[256] = {0};
            char new_ver[32] = {0};
            char target[4] = {0};
            bool do_update = false;

