luomeng16888/stm32-ota-update/bootloader/STM32F407/Projects/MDK-ARM/bootloader_main.c
            sd_reinit();
            FRESULT fr = f_open(&fil, SD_FW_FLAG, FA_READ);
            printf("[BOOT] update.flag: %s\r\n",
                   (fr == FR_OK) ? "FOUND" : "not found");

            if (fr == FR_OK) {
                memset(flag, 0, sizeof(flag));
                f_read(&fil, flag, sizeof(flag) - 1, &br);
                f_close(&fil);
                printf("[BOOT] Flag: [%s]\r\n", flag);

                {
                    char *p = strstr(flag, "target=");
                    if (p) { target[0] = p[7]; target[1] = '\0'; }
                }
                {
                    char *p = strstr(flag, "version=");
                    if (p) {
                        char *s = p + 8;
                        int i = 0;
                        while (*s && *s != '\n' && *s != '\r' && i < 31)
                            new_ver[i++] = *s++;
                        new_ver[i] = '\0';
                    }
                }

                /* [v3.2] ?? new_ver */
                if (strlen(new_ver) > 0 && !is_valid_version(new_ver)) {
                    printf("[BOOT] update.flag has invalid version: %s, skip\r\n",
                           new_ver);
                    f_unlink(SD_FW_FLAG);
                } else if (strlen(new_ver) > 0) {
                    const char *cur = boot_cfg_active_ver(&cfg);
                    if (strcmp(cur, new_ver) == 0) {
                        printf("[BOOT] Already v%s, skip\r\n", new_ver);
                    } else {
                        do_update = true;
                        printf("[BOOT] Update: v%s -> v%s target=%s\r\n",
                               cur, new_ver, target);
                    }
                }
            }

            /* ==================================================
             *  ????
             * ================================================== */
            if (do_update) {
                char target_part;
                bool is_diff = false;

                if (target[0] == 'A' || target[0] == 'B')
                    target_part = target[0];
                else
                    target_part = (cfg.active[0] == 'A') ? 'B' : 'A';

                if (strstr(flag, "mode=diff"))
                    is_diff = true;

                lcd_clear(C_WHITE);
                lcd_title(10, is_diff ? "DIFF UPDATE" : "FULL UPDATE");
                lcd_fmt(45, C_ORANGE, "Version: v%s", new_ver);
                lcd_fmt(65, C_CYAN, "Target: Partition %c", target_part);

                bool ok = false;

                if (is_diff) {
                    char src_part = cfg.active[0];
                    lcd_info(85, "Applying SDIFF01 to Flash...");
                    printf("[BOOT] Diff: src=%c dst=%c\r\n",
                           src_part, target_part);
                    ok = sd_diff_update(SD_FW_PATCH, target_part,
                                        src_part, new_ver, &cfg);
                } else {
                    lcd_info(85, "Writing full firmware...");
                    ok = sd_full_update(SD_FW_BIN, target_part,
                                        new_ver, &cfg);
                }

                if (ok) {
                    f_unlink(SD_FW_FLAG);
                    printf("[BOOT] Update done, rebooting\r\n");
                    lcd_clear(C_WHITE);
                    lcd_ok(30, "UPDATE SUCCESS!");
                    lcd_fmt(65, C_CYAN, "Partition %c: v%s",
                            target_part, new_ver);
                    delay_ms(1000);
                    NVIC_SystemReset();
                } else {
                    lcd_err(30, "UPDATE FAILED!");
                    lcd_warn(65, "Keeping current partition");
                    delay_ms(2000);
                    lcd_clear(C_WHITE);
                    lcd_title(10, "Bootloader v3.2");
                }
            }
        }
    }

    /* ==========================================================
     *  ??? App
     * ========================================================== */
do_jump:
    target_addr = boot_cfg_active_addr(&cfg);

    lcd_fmt(130, C_GREEN, "Starting Partition %c...", cfg.active[0]);
    lcd_fmt(150, C_CYAN, "v%s @ 0x%08lX",
            boot_cfg_active_ver(&cfg), (unsigned long)target_addr);

    printf("[BOOT] -> Partition %c @ 0x%08lX (v%s)\r\n",
           cfg.active[0], (unsigned long)target_addr,
           boot_cfg_active_ver(&cfg));

    debug_dump_flash(target_addr, 8);

    delay_ms(300);
    jump_to_app(target_addr);

    while (1);
}
